Revit 2026 API

# ColorBackgroundSettingsColor Property

---

The color of the rendering background.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Color Color { get; set; }
```
```vb
Public Property Color As Color
	Get
	Set
```
```cpp
public:
property Color^ Color {
	Color^ get ();
	void set (Color^ value);
}
```
```fsharp
member Color : Color with get, set
```

#### Property Value

Color

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

ColorBackgroundSettings Class

Autodesk.Revit.DB Namespace